'use strict';

// Task #1
// Оголосіть дві змінні: admin та name.
// Запишіть рядок "John" у змінну назву.
// Скопіюйте значення зі змінної name в admin.
// Виведіть на екран значення admin, використовуючи функцію alert.

let admin;
let name;

name = 'John';
admin = name;

alert(admin);

// Task #2
// Створіть змінну назви нашої планети. Як ви її назвете?
// Створіть змінну для зберігання імені відвідувача сайту. Як би ви назвали таку змінну?

let planetName = 'Earth';
let userName = 'John';

// Task #3
// Створити змінну і зберегти в ній значення 10 (рядок) + 10 (число),
// перевірити її тип і вивести його в консоль, вивчити питання чому саме так все працює.

let sum = '10' + 10;
console.log(typeof sum);


