'use strict';

let a = 5;
let b = 10;

//Якщо змінна a дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Неправильно'.
let res1 = a === 0 ? 'Вірно' : 'Неправильно';
//Якщо змінна a більша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'.
let res2 = a > 0 ? 'Вірно' : 'Невірно';
//Якщо змінна a менша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'.
let res3 = a < 0 ? 'Вірно' : 'Невірно';
// Якщо змінна a більша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Неправильно'.
let res4 = a >= 0 ? 'Вірно' : 'Неправильно';
//Якщо змінна a менша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Неправильно'.
let res5 = a <= 0 ? 'Вірно' : 'Неправильно';
// Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
let res6 = a !== 0 ? 'Вірно' : 'Невірно';
//Якщо змінна a дорівнює 'test', виведіть 'Вірно', інакше виведіть 'Неправильно'.
let res7 = a === 'test' ? 'Вірно' : 'Неправильно';
//Якщо змінна a дорівнює '1' і за значенням і типом, то виведіть 'Вірно', інакше виведіть 'Невірно'.
let res8 = a === '1' ? 'Вірно' : 'Невірно';
//Якщо змінна a більша за нуль і менше 5-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
let res9 = a > 0 && a < 5 ? 'Вірно' : 'Невірно';
//Якщо змінна a дорівнює нулю або дорівнює двом, додайте до неї 7, інакше поділіть її на 10. Виведіть нове значення змінної на екран.
let res10 = a === 0 || a === 2 ? a + 7 : a / 10;
alert(res10);
//Якщо змінна a дорівнює або менше 1, а змінна b більша або дорівнює 3, то виведіть суму цих змінних, інакше виведіть їх різницю (результат віднімання).
let res11 = a <= 1 && b >= 3 ? a + b : a - b;
//Якщо змінна a більше 2-х і менше 11-ти, або змінна b більша або дорівнює 6-ти і менше 14-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
let res12 = (a > 2 && a < 11) || (b >= 6 && b < 14) ? 'Вірно' : 'Невірно';
//Змінна num може приймати 4 значення: 1, 2, 3 або 4. Якщо вона має значення 1, то в змінну result запишемо зима, якщо має значення 2 - весна і так далі.
//Розв'яжіть завдання через switch-case.
let num = 1;
let result;

switch (num) {
 	case 1:
 		result = 'зима';
 		break;
 	case 2:
 		result = 'весна';
        break;
 	case 3:
 		result = 'літо';
		break;
 	case 4:
 		result = 'осінь';
 		break;
 	default:
 		result = 'undefined';
 }
// Варіант 2
//const seasons = ['зима', 'весна', 'літо', 'осінь'];
//num--;
//result = num >= 0 && num < seasons.length ? seasons[num] : 'undefined';

//Варіант 3
//const fourSeasons = { 1: 'зима', 2: 'весна', 3: 'літо', 4: 'осінь' };
//result = fourSeasons[num] ?? 'undefined';

console.log(result);